#include <stdio.h>

void main()
{
    int i = 2;
    printf("%d, %d, %d, %d\n", i++, ++i, i, i++);
    printf("%d\n", i);

    i = 8;
    printf("i++*2=%d, i=%d, i=%d, i=%d\n========\n", i++ * 2, i++, i++, ++i);

    i = 8;
    printf("i=8, ++i, --i, i++, i--, -i++, -i-- is\n%d\n%d\n%d\n%d\n%d\n%d\n", ++i, --i, i++, i--, -i++, -i--);
}

//输出结果为
//4, 5, 5, 2
//5
//i++*2=22, i=10, i=9, i=12
//========
//i=8, ++i, --i, i++, i--, -i++, -i-- is
//8
//8
//7
//8
//-7
//-8
//从右向左运算赋值，然后从左向右打印？没理解

//据说在不同的编译器下结果是不一样的... ...