int main()
{
    int sum = 0, n = 100;  /* 执行一次 */
    sum = (1 + n) * n / 2; /* 执行一次 */
    printf("%d", sum);     /* 执行一次 */

    int sum = 0, n = 100;  /* 执行1次 */
    sum = (1 + n) * n / 2; /* 执行第1次 */
    sum = (1 + n) * n / 2; /* 执行第2次 */
    sum = (1 + n) * n / 2; /* 执行第3次 */
    sum = (1 + n) * n / 2; /* 执行第4次 */
    sum = (1 + n) * n / 2; /* 执行第5次 */
    sum = (1 + n) * n / 2; /* 执行第6次 */
    sum = (1 + n) * n / 2; /* 执行第7次 */
    sum = (1 + n) * n / 2; /* 执行第8次 */
    sum = (1 + n) * n / 2; /* 执行第9次 */
    sum = (1 + n) * n / 2; /* 执行第10次 */
    printf("%d", sum);     /* 执行1次 */
}