# Python中列表、元组、字符串都是序列，有一些共同方法

# 1. 拼接
[1, 2, 3]+[4, 5, 6]  # [1, 2, 3, 4, 5, 6]
(1, 2, 3)+(4, 5, 6)  # (1, 2, 3, 4, 5, 6)
"123"+"456"          # '123456'

# 2. 重复
[1, 2, 3]*3  # [1, 2, 3, 1, 2, 3, 1, 2, 3]
(1, 2, 3)*3  # (1, 2, 3, 1, 2, 3, 1, 2, 3)
"123"*3      # '123123123'

s = [1, 2, 3]
id(s)    # 139994662185544
s *= 3
id(s)    # 139994662185544
t = (1, 2, 3)
id(t)    # 139994661119464
t *= 3
id(t)    # 139994661439192

# 3. 包含  in, not in
"micha" in ["tom", "jim", "micha"]      # True
"micha" not in ["tom", "jim", "micha"]  # Flase

# 4. 删除  del
x = [1, 2, 3]
y = "123"
del x, y  # 这时，x与y两个序列就已经被删除了

x = [1, 2, 3, 4, 5]
del x[1:4]
x                    # [1, 5]
y = [1, 2, 3, 4, 5]
y[1:4] = []
y                    # [1, 5]

x = [1, 2, 3, 4, 5]
del x[::2]
x                    # [2, 4]
y = [1, 2, 3, 4, 5]
y[::2] = []          # 切片无法替换不连续的区间，抛异常
y                    # [1, 2, 3, 4, 5]

x = [1, 2, 3, 4, 5]
x.clear()
x                    # []
y = [1, 2, 3, 4, 5]
del y[:]             # 不可以 del y，因为这个是把 y 对象删除，而不是清空 y 对象
y                    # []
