# 1. 格式化字符串
year = 2016
"XXX成立于{}年。".format(year)
"1+2={}, 2的平方是{}, 3的立方是{}.".format(1+2, pow(2, 2), pow(3, 3))
"1+2={2}, 2的平方是{1}, 3的立方是{0}.".format(pow(3, 3), pow(2, 2), 1+2)
"我叫{name}，我爱{0}，{0}真的很爽。".format("Python", name="micha")
"{}-{}-{}".format("A", "{}", "Z")  # A-{}-Z  输出 {}
"{}-{{}}-{}".format("A", "Z")      # A-{}-Z  输出 {}

"{:^}".format(250)                   # '250'
"{:^10}".format(250)                 # '   250    '
"{1:>10}{0:<10}".format(520, 250)    # '       250520       '
"{1:<10}{0:>10}".format(520, 250)    # '250              520'
"{left:>10}{right:<10}".format(right=520, left=250)  # '       250520       '
"{:010}".format(520)                 # '0000000520'
"{:010}".format(-520)                # '-000000520'
"{:010}".format("Python")            # 设置前导0只对数字有效，字符串会抛异常
"{1:%>10}{0:%<10}".format(520, 250)  # '%%%%%%%250520%%%%%%%'
"{:0=10}".format(520)                # '0000000520'
"{:0=10}".format(-520)               # '-000000520'

"{:+} {:-}".format(520, -250)     # '+520 -250'
"{:,}".format(12345678)           # '12,345,678'
"{:_}".format(12345678)           # '12_345_678'
"{:.4f}".format(3.1415926)        # '3.1416'
"{:.4g}".format(3.1415926)        # '3.142'
"{:.6}".format("I love Python.")  # 'I love'
"{:.2}".format(1024)              # 精度格式化对整型无效，抛异常

"{:b}".format(80)   # '1010000'
"{:#b}".format(80)  # '0b1010000'
"{:c}".format(80)   # 'P'  Unicode字符
"{:d}".format(80)   # '80'
"{:o}".format(80)   # '120'
"{:#o}".format(80)  # '0o120'
"{:x}".format(80)   # '50'
"{:#x}".format(80)  # '0x50'
"{:#X}".format(80)  # '0X50'

"{:e}".format(3.14)       # '3.140000e+00'
"{:E}".format(3.14)       # '3.140000E+00'
"{:f}".format(3.14)       # '3.140000'
"{:g}".format(12345678)   # '1.23457e+07'
"{:g}".format(1234.5678)  # '1234.57'
"{:%}".format(0.98)       # '98.000000%'
"{:.2%}".format(0.98)     # '98.00%'

"{:.{prec}f}".format(3.1415926, prec=2)  # '3.14'
"{:{fill}{align}{width}.{prec}{ty}}".format(
    3.1415926, fill='+', align='^', width=10, prec=3, ty='g')  # '+++3.14+++'
