using System;
using System.IO;

namespace WindowsFormsApp0
{
    public static class MyUtilsResources
    {
        private static readonly DirectoryInfo ParentPath = Directory.GetParent(Environment.CurrentDirectory);
        public static string StaticFilePath = Path.Combine(ParentPath.Parent.FullName, "StaticFiles");
        public static string TemporaryFilesPath = Path.Combine(ParentPath.Parent.FullName, "StaticFiles", "TemporaryFiles");
        public static string ConfigFilePath = Path.Combine(ParentPath.Parent.FullName, "ConfigFiles");
        public static string PluginFilePath = Path.Combine(ParentPath.Parent.FullName, "Plugins");

        public static readonly string chars_0 = "0123456789";
        public static readonly string chars_a = "abcdefghijklmnopqrstuvwxyz";
        public static readonly string chars_A = "ABCDEFGHIJKLMNOPQRSTUVWXYZ";
        public static readonly string chars_0a = "0123456789abcdefghijklmnopqrstuvwxyz";
        public static readonly string chars_0A = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ";
        public static readonly string chars_aA = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ";
        public static readonly string chars_0aA = "0123456789abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ";

        public static readonly string chars_Dec = "0123456789";
        public static readonly string chars_Bin = "01";
        public static readonly string chars_Oct = "01234567";
        public static readonly string chars_Hex = "0123456789abcdefABCDEF";
        public static readonly string chars_Hex_Upper = "0123456789ABCDEF";
        public static readonly string chars_Hex_Lower = "0123456789abcdef";

        public static readonly string regex_mac = @"^([0-9a-fA-F]{2})(([/\s:-][0-9a-fA-F]{2}){5})$";
        public static readonly string regex_ipv4 = @"(?=(\b|\D))(((\d{1,2})|(1\d{1,2})|(2[0-4]\d)|(25[0-5]))\.){3}((\d{1,2})|(1\d{1,2})|(2[0-4]\d)|(25[0-5]))(?=(\b|\D))";
        public static readonly string regex_ipv6 = @"^([\\da-fA-F]{1,4}:){7}([\\da-fA-F]{1,4})$";
        //yyyy-mm-dd
        public static readonly string regex_date = @"^((((1[6-9]|[2-9]\d)\d{2})-(0?[13578]|1[02])-(0?[1-9]|[12]\d|3[01]))|(((1[6-9]|[2-9]\d)\d{2})-(0?[13456789]|1[012])-(0?[1-9]|[12]\d|30))|(((1[6-9]|[2-9]\d)\d{2})-0?2-(0?[1-9]|1\d|2[0-8]))|(((1[6-9]|[2-9]\d)(0[48]|[2468][048]|[13579][26])|((16|[2468][048]|[3579][26])00))-0?2-29))$";
        public static readonly string regex_digit = @"(?!.*?(\d).*?\1.*?$)\d+";
        public static readonly string regex_digitNoDuplicate = @".*?(\d).*?\1.*?$";

        public static readonly string connstrMyTestDataBase2014 = "Data Source=.;Initial Catalog=MyTestDataBase;User Id=sa;Password=q1w2E#R$#2014;";
        public static readonly string connstrMyTestDataBase2019 = "Data Source=.;Initial Catalog=MyTestDataBase;User Id=sa;Password=q1w2E#R$#2019;";
        public static readonly string connstrAdventureWorks2014 = "Data Source=.;Initial Catalog=AdventureWorks2014;User Id=sa;Password=q1w2E#R$#2014;";
        public static readonly string connstrAdventureWorksDW2014 = "Data Source=.;Initial Catalog=AdventureWorksDW2014;User Id=sa;Password=q1w2E#R$#2014;";

        public static readonly string[] 百家姓 = new string[] { "赵","钱","孙","李","周","吴","郑","王","冯","陈","褚","卫","蒋","沈","韩","杨","朱","秦","尤","许",
"何","吕","施","张","孔","曹","严","华","金","魏","陶","姜","戚","谢","邹","喻","柏","水","窦","章",
"云","苏","潘","葛","奚","范","彭","郎","鲁","韦","昌","马","苗","凤","花","方","俞","任","袁","柳",
"酆","鲍","史","唐","费","廉","岑","薛","雷","贺","倪","汤","滕","殷","罗","毕","郝","邬","安","常",
"乐","于","时","傅","皮","卞","齐","康","伍","余","元","卜","顾","孟","平","黄","和","穆","萧","尹",
"姚","邵","湛","汪","祁","毛","禹","狄","米","贝","明","臧","计","伏","成","戴","谈","宋","茅","庞",
"熊","纪","舒","屈","项","祝","董","梁","杜","阮","蓝","闵","席","季","麻","强","贾","路","娄","危",
"江","童","颜","郭","梅","盛","林","刁","钟","徐","邱","骆","高","夏","蔡","田","樊","胡","凌","霍",
"虞","万","支","柯","昝","管","卢","莫","经","房","裘","缪","干","解","应","宗","丁","宣","贲","邓",
"郁","单","杭","洪","包","诸","左","石","崔","吉","钮","龚","程","嵇","邢","滑","裴","陆","荣","翁",
"荀","羊","於","惠","甄","曲","家","封","芮","羿","储","靳","汲","邴","糜","松","井","段","富","巫",
"乌","焦","巴","弓","牧","隗","山","谷","车","侯","宓","蓬","全","郗","班","仰","秋","仲","伊","宫",
"宁","仇","栾","暴","甘","钭","厉","戎","祖","武","符","刘","景","詹","束","龙","叶","幸","司","韶",
"郜","黎","蓟","薄","印","宿","白","怀","蒲","邰","从","鄂","索","咸","籍","赖","卓","蔺","屠","蒙",
"池","乔","阴","郁","胥","能","苍","双","闻","莘","党","翟","谭","贡","劳","逄","姬","申","扶","堵",
"冉","宰","郦","雍","郤","璩","桑","桂","濮","牛","寿","通","边","扈","燕","冀","郏","浦","尚","农",
"温","别","庄","晏","柴","瞿","阎","充","慕","连","茹","习","宦","艾","鱼","容","向","古","易","慎",
"戈","廖","庾","终","暨","居","衡","步","都","耿","满","弘","匡","国","文","寇","广","禄","阙","东",
"欧","殳","沃","利","蔚","越","夔","隆","师","巩","厍","聂","晁","勾","敖","融","冷","訾","辛","阚",
"那","简","饶","空","曾","毋","沙","乜","养","鞠","须","丰","巢","关","蒯","相","查","後","荆","红",
"游","竺","权","逯","盖","益","桓","公","万俟","司马","上官","欧阳","夏侯","诸葛",
"闻人","东方","赫连","皇甫","尉迟","公羊","澹台","公冶","宗政","濮阳",
"淳于","单于","太叔","申屠","公孙","仲孙","轩辕","令狐","钟离","宇文",
"长孙","慕容","鲜于","闾丘","司徒","司空","亓官","司寇","仉","督","子车",
"颛孙","端木","巫马","公西","漆雕","乐正","壤驷","公良","拓跋","夹谷",
"宰父","谷梁","晋","楚","闫","法","汝","鄢","涂","钦","段干","百里","东郭","南门",
"呼延","归","海","羊舌","微生","岳","帅","缑","亢","况","后","有","琴","梁丘","左丘",
"东门","西门","商","牟","佘","佴","伯","赏","南宫","墨","哈","谯","笪","年","爱","阳","佟",
"第五","言","福"};

        public static readonly string 诫子书 = @"将 悲 多 遂 意 年 险 淫 非 非 才 夫 非 非 俭 静 夫
复 守 不 成 与 与 躁 慢 志 学 须 学 宁 淡 以 以 君
何 穷 接 枯 日 时 则 则 无 无 学 须 静 泊 养 修 子
及 庐 世 落 去 驰 不 不 以 以 也 静 无 无 德 身 之
！ ， ， ， ， ， 能 能 成 广 ， 也 以 以 。 ， 行
                  治 励 学 才    ， 致 明       ，
                  性 精 。 ，       远 志         
                  。 ，             。 ，         ";

        public static readonly string 诫子书HTML = @"<h4>将&nbsp;悲&nbsp;多&nbsp;遂&nbsp;意&nbsp;年&nbsp;险&nbsp;淫&nbsp;非&nbsp;非&nbsp;才&nbsp;夫&nbsp;非&nbsp;非&nbsp;俭&nbsp;静&nbsp;夫</h4>
<h4>复&nbsp;守&nbsp;不&nbsp;成&nbsp;与&nbsp;与&nbsp;躁&nbsp;慢&nbsp;志&nbsp;学&nbsp;须&nbsp;学&nbsp;宁&nbsp;淡&nbsp;以&nbsp;以&nbsp;君</h4>
<h4>何&nbsp;穷&nbsp;接&nbsp;枯&nbsp;日&nbsp;时&nbsp;则&nbsp;则&nbsp;无&nbsp;无&nbsp;学&nbsp;须&nbsp;静&nbsp;泊&nbsp;养&nbsp;修&nbsp;子</h4>
<h4>及&nbsp;庐&nbsp;世&nbsp;落&nbsp;去&nbsp;驰&nbsp;不&nbsp;不&nbsp;以&nbsp;以&nbsp;也&nbsp;静&nbsp;无&nbsp;无&nbsp;德&nbsp;身&nbsp;之</h4>
<h4>！&nbsp;，&nbsp;，&nbsp;，&nbsp;，&nbsp;，&nbsp;能&nbsp;能&nbsp;成&nbsp;广&nbsp;，&nbsp;也&nbsp;以&nbsp;以&nbsp;。&nbsp;，&nbsp;行</h4>
<h4>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;治&nbsp;励&nbsp;学&nbsp;才&nbsp;&nbsp;&nbsp;&nbsp;，&nbsp;致&nbsp;明&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;，</h4>
<h4>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;性&nbsp;精&nbsp;。&nbsp;，&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;远&nbsp;志&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</h4>
<h4>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;。&nbsp;，&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;。&nbsp;，&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</h4>";

        public static readonly string 将进酒 = @"将进酒
君不见黄河之水天上来，奔流到海不复回。
君不见高堂明镜悲白发，朝如青丝暮成雪。
人生得意须尽欢，莫使金樽空对月。
天生我材必有用，千金散尽还复来。
烹羊宰牛且为乐，会须一饮三百杯。
岑夫子，丹丘生，将进酒，杯莫停。
与君歌一曲，请君为我倾耳听。
钟鼓馔玉不足贵，但愿长醉不复醒。
古来圣贤皆寂寞，惟有饮者留其名。
陈王昔时宴平乐，斗酒十千恣欢谑。
主人何为言少钱，径须沽取对君酌。
五花马，千金裘，
呼儿将出换美酒，与尔同销万古愁。";

        public static readonly string 将进酒HTML = @"<h3>将进酒</h3>
<h4>君不见黄河之水天上来，奔流到海不复回。</h4>
<h4>君不见高堂明镜悲白发，朝如青丝暮成雪。</h4>
<h4>人生得意须尽欢，莫使金樽空对月。</h4>
<h4>天生我材必有用，千金散尽还复来。</h4>
<h4>烹羊宰牛且为乐，会须一饮三百杯。</h4>
<h4>岑夫子，丹丘生，将进酒，杯莫停。</h4>
<h4>与君歌一曲，请君为我倾耳听。</h4>
<h4>钟鼓馔玉不足贵，但愿长醉不复醒。</h4>
<h4>古来圣贤皆寂寞，惟有饮者留其名。</h4>
<h4>陈王昔时宴平乐，斗酒十千恣欢谑。</h4>
<h4>主人何为言少钱，径须沽取对君酌。</h4>
<h4>五花马，千金裘，</h4>
<h4>呼儿将出换美酒，与尔同销万古愁。</h4>";

        public static readonly string 尼布尔祷告词_原文 = @"The Serenity Prayer
God grant me the serenity to accept the things I cannot change;
the courage to change the things I can;
and wisdom to know the difference.
Living one day at a time; Enjoying one moment at a time;
Accepting hardships as the pathway to peace;
Taking, as Jesus did, this sinful world as it is, not as I would have it;
Trusting that You will make all things right if I surrender to Your will;
That I may be reasonably happy in this life and supremely happy with You Forever in the next.

Amen
-----Reinhold Niebuhr";

        public static readonly string 尼布尔祷告词_译文1 = @"上帝，
请赐予我平静，
去接受我无法改变的。
给予我勇气，
去改变我能改变的，
赐我智慧，
分辨这两者的区别。
 
过好我的每一天，
享受你所赐每一刻，
把困苦当成通往平安的道路，
像主耶稣那样，
接受这罪恶的世界，
按其现实本相，
而非如我所愿，
相信他会使一切变得美好，
只要我顺服他的旨意；
我可以在此生有合宜的欢乐，
并在永生里，
与他永享至福。";

        public static readonly string 尼布尔祷告词_译文2 = @"上主，
力不能挽者，求賞我泰然處之，
力能挽者，求賞我毅然為之，
孰此孰彼，求賞我智慧以明辨之。

活在當下，珍惜當下，
接納艱辛乃導向平安的路徑。

能如基督坦誠承受這罪惡的世態，
按其現實本相，而非照我所願；
相信凡事祂會歸正妥善，若我順服祂的旨意；
如此，我或許在今生得享適度的喜悅，
在未來能享永遠與主同在的無上喜樂。

阿們";

        public static readonly string 德道经 = @"上德不德 是以有德 下德不失德 是以无德
上德无为 而无以为也 下德为之 而有以为
上仁为之 而无以为也 上义为之 而有以为也
上礼为之 而莫之应也 则攘臂而扔之
故 失道而后德 失德而后仁 失仁而后义 失义而后礼
夫礼者 忠信之薄也 而乱之首也
前识者 道之华也 而愚之首也
是以大丈夫居其厚而不居其薄 居其实而不居其华 故去彼而取此

昔之得一者 天得一以清 地得一以宁 神得一以灵 谷得一以盈 万物得一以生 侯得一以为天下正?
其致之也 谓天毋已清 将恐裂 谓地毋已宁 将恐废 谓神毋已灵 将恐歇 谓谷毋已盈 将恐竭 谓万物毋已生 将恐灭 谓侯王毋已贵以高 将恐蹶
故 必贵而以贱为本 必高矣而以下为基 夫是以 侯王自谓 孤 寡 不谷 此其贱之本与 非也?
故致数与无与 是故不欲禄禄若玉 珞珞若石

上士闻道 堇能行之 中士闻道 若存若亡 下士闻道 大笑之
弗笑不足以为道 是以建言有之曰 明道如费 进道如退 夷道如类 上德如谷 大白如辱 广德如不足 建德如偷 质真如渝 大方无隅 大器晚成 大音希声 天象无刑 道褒无名 夫唯道? 善始且善成

反也者 道之动也 弱也者 道之用也 天下之物生于有 有生于无

道生一 一生二 二生三 三生万物
万物负阴而抱阳 中气以为和 天下之所恶 唯孤 寡 不谷 而王公以自名也
物或损之而益 益之而损 故人之所教 亦议而教人
故强梁者不得死 我将以为学父

天下之至柔 驰骋于天下之至坚 无有入于无间 吾是以知无为之有益也
不言之教 无为之益 天下希能及之矣

名与身孰亲 身与货孰多 得与亡孰病
甚爱必大费 多藏必厚亡 故知足不辱 知止不殆 可以长久

大成若缺 其用不弊 大盈若冲 其用不穷 大直如诎 大巧如拙 大辩如讷 躁胜寒 靓胜炅 请静可以为天下正

天下有道 却走马以粪 天下无道 戎马生于郊
罪莫大于可欲 祸莫大于不知足 咎莫憯于欲得 故知足之足 恒足矣

不出于户 以知天下 不窥于牖 以知天道 其出也弥远 其知也弥少
是以圣人不行而知 不见而明 弗为而成

为学者日益 为道者日损 损之有损 以至于无为 无为而无不为
将欲取天下也 恒无事 及其有事也 又不足以取天下矣

圣人恒无心 以百姓之心为心 善者善之 不善者亦善之 德善也 信者信之 不信者亦信之 德信也
圣人之在天下 詥焉 为天下浑心 百姓皆属耳目焉 圣人皆孩之

出生 入死 生之徒十有三 死之徒十有三 而人之生 动皆之死地之十有三 夫何故也 以其生生之厚也
盖闻善执生者 陵行不遇兕虎 入军不被甲兵 兕无所揣其角 虎无所措其蚤 兵无所容其刃 夫何故也 以其无死地焉

道生之 而德畜之 物刑之 而器成之 是以万物尊道而贵德
道之尊 德之贵也 夫莫之爵而恒自然也
道生之 畜之 长之 育之 亭之 毒之 养之 覆之 生而弗有也 为而弗恃也 长而弗宰也 此之谓玄德

天下有始 以为天下母 既得其母 以知其子 既知其子 复守其母 没身不殆
塞其兑 闭其门 终身不堇 启其兑 济其事 终身不棘
见常曰明 守柔曰强 用其光 复归其明 毋遗身殃 是谓袭常

使我介然有知也 行于大道 唯施是畏
大道甚夷 民甚好解
朝甚除 田甚芜 仓甚虚 服文采 带利剑 厌食而财货有余 是谓盗夸 盗夸 非道也

善建者不拔 善抱者不脱 子孙以祭祀不绝
修之身 其德乃真 修之家 其德有余 修之乡 其德乃长 修之国 其德乃夆 修之于天下 其德乃博
以身观身 以家观家 以乡观乡 以邦观邦 以天下观天下 吾何以知天下然兹 以此

含德之厚者 比于赤子 蜂虿虺蛇弗蜇 攫鸟猛兽弗搏 骨弱筋柔而握固 未知牝牡之会而脧怒? 精之至也 终日号而不耰 和之至也
知和曰常 知常曰明 益生曰祥 心使气曰强 物壮则老 谓之不道 不道早亡

知者弗言 言者弗知
塞其兑 闭其门 和其光 同其尘 挫其锐 解其纷 是谓玄同
故 不可得而亲 不可得而疏 不可得而利 亦不可得而害 不可得而贵 亦不可得而贱 故为天下贵

以正治邦 以奇用兵 以无事取天下
吾何以知其然哉
夫天下多忌讳 而民弥贫 人多利器 而国家滋昏 民多伎能 而奇物滋起 法物滋彰 盗贼多有
是以圣人之言曰 我无为也 而民自化 我好静 而民自正 我无事 而民自富 我欲无欲 而民自朴

其政闵闵 其民屯屯 其正察察 其邦缺缺
祸 福之所倚 福 祸之所伏 孰知其极
其无正也 正复为奇 善复为妖 人之悉也 其日固久矣 是以方而不割 兼而不刺 直而不绁? 光而不眺

治人 事天 莫若啬
夫唯啬 是以蚤服 蚤服是谓重积德 重积德则无不克 无不克则莫知其极 莫知其极 可以有国 有国之母 可以长久 是谓深根固氐 长生久视之道也

治大国若烹小鲜
以道莅天下 其鬼不神 非其鬼不神也 其神不伤人也 非其神不伤人也 圣人亦弗伤也 夫两不相伤 故德交归焉

大邦者 下流也 天下之牝 天下之交也
牝恒以静胜牡 为其静也 故大邦以下小邦 则取小国 小邦以下大邦 则取于大邦
故 或下以取 或下而取 故 大邦者不过欲兼畜人 小邦者不过欲入事人 夫皆得其欲 则大者宜为下

道者 万物之注也 善人之宝也 不善人之所保也
美言可以市 尊行可以贺人
人之不善 何弃之有 故立天子 置三卿 虽有拱之璧以先驷马 不若坐进此道
古之所以贵此道者何也 不谓求以得 有罪以免与 故为天下贵

为无为 事无事 味无味 大小 多少 报怨以德
图难乎其易也 为大乎其细也 天下之难作于易 天下之大作于细 是以圣人终不为大 故能成其大
夫轻诺必寡信 多易必多难 是以圣人猷难之 故终于无难

其安也 易持也 其未兆也 易谋也 其脆易判 其微易散
为之于其未有 治之于其未乱 合抱之木 作于毫末 九成之台 起于蔂土 百仞之高 始于足下 为之者败之 执者失之
是以圣人无为也 故无败也 无执也 故无失也
民之从事也 恒于几成而败之 慎终若始 则无败事矣 是以圣人欲不欲 而不贵难得之货 学不学 而复众人之所过 能辅万物之自然而弗敢为

故曰 为道者非以明民也 将以愚之也
民之难治也 以其知也 故以知知邦 邦之贼也 以不知知邦 邦之德也 恒知此两者亦稽式也?
恒知稽式 此谓玄德 玄德深矣 远矣 与物反矣 乃至大顺

江海之所以能为百谷王者 以其善下之也 故能为百谷王
是以圣人之欲上民也 必以其言下之 其欲先民也 必以其身后之
故居前而民弗害也 居上而民弗重也 天下乐推而弗厌也 非以其无诤与 故天下莫能与争

小邦 寡民 使有什佰人之器而毋用 使民重死而远徙 有车舟无所乘之 有甲兵无所陈之 使民复结绳而用之 甘其食 美其服 乐其俗 安其居 邻邦相望 鸡犬之声相闻 民至老死不相往来

信言不美 美言不信 知者不博 博者不知 善者不多 多者不善
圣人无积 既以为人 己愈有 既以予人 己愈多
故 天之道 利而不害 人之道 为而弗争

天下皆谓我大 大而不宵 夫唯不宵 故能大 若宵 久矣其细也夫
我恒有三宝 持而保之 一曰慈 二曰俭 三曰不敢为天下先
慈 故能勇 俭 故能广 不敢为天下先 故能成事长 今舍其慈 且勇 舍其俭 且广 舍其后 且先 则必死矣 夫慈 以战则胜 以守则固 天将健之 如以慈垣之

善为士者不武 善战者不怒 善胜敌者弗与 善用人者为之下 是谓不诤之德 是谓用人 是谓肥天 古之极也

用兵有言曰 吾不敢为主而为客 吾不进寸而退尺 是谓行无行 攘无臂 执无兵 乃无敌矣
祸莫大于无敌 无敌近亡吾葆矣 故乘兵相若 则哀者胜矣

吾言甚易知也 甚易行也 而人莫之能知也 而莫之能行也
言有君 事有宗 其唯无知也 是以不我知 知者希 则我贵矣 是以圣人被褐而怀玉

知不知 尚矣 不知不知 病矣 是以圣人之不病 以其病病也 是以不病

民之不畏畏 则大畏将至矣
毋闸其所居 毋猒其所生
夫唯弗猒 是以不厌 是以圣人自知而不自见也 自爱而不自贵也 故去彼取此

勇于敢者则杀 勇于不敢者则活 此两者 或利或害 天之所恶 孰知其故
天之道 不战而善胜 不言而善应 不召而自来 单而善谋 天网恢恢 疏而不失

若民恒且不畏死 奈何以死惧之
若民恒且畏死 而为畸者吾将得而杀之 夫孰敢矣
若民恒且必畏死 则恒有司杀者
夫代司杀者杀 是代大匠斫也 夫代大匠斫者 稀有不伤其手矣

民之饥也 以其上食税之多也 是以饥
百姓之不治也 以其上之有以为也 是以不治
民之轻死也 以其求生之厚也 是以轻死
夫唯无以生为者 是贤贵生

人之生也柔弱 其死也月亘坚强 万物草木之生也柔脆 其死也枯槁
故曰 坚强者 死之徒也 柔弱微细者 生之徒也
是以兵强则不胜 木强则恒 强大居下 柔弱细微居上

天之道 犹张弓者也 高者印之 下者举之 有余者损之 不足者补之
故 天之道 损有余而益不足 人之道则不然 损不足而奉有余?
孰能有余而有以取奉于天者乎 唯又道者乎
是以圣人为而不恃 功成而不居也 若此 其不欲见贤也

天下莫柔弱于水 而攻坚强者莫之能先也 以其无以易之也
水之胜刚也 弱之胜强也 天下莫弗知也 而莫之能行也 故圣人言云曰 受邦之垢 是谓社稷之主 受邦之不祥 是为天下之王 正言若反

和大怨 必有余怨 焉可以为善 是以圣人右介 而不以责于人
故 有德司介 无德司彻 夫天道无亲 恒与善人

道可道也 非恒道也 名可名也 非恒名也
无 名天地之始也 有 名万物之母也
故 恒无 欲以观其眇也 恒有 欲以观其所徼也
两者同出 异名同谓 玄之又玄 众妙之门

天下皆知美之为美 恶已 皆知善之为善 斯不善矣
有无之相生也 难易之相成也 长短之相形也 高下相盈也 音声之相和也，先后之相随 恒也
是以圣人居无为之事 行不言之教 万物作而弗始也 为而弗恃也 成功而弗居也夫唯弗居 是以弗去

不上贤 使民不争 不贵难得之货 使民不为盗 不见可欲 使民不乱
是以圣人之治也 虚其心 实其腹 弱其志 强其骨 恒使民无知无欲也
使夫知不敢 弗为而已 则无不治矣

道冲 而用之有弗盈也 渊兮 似万物之宗
挫其锐 解其纷 和其光 同其尘 湛兮 似或存 吾不知其谁之子 象帝之先

天地不仁 以万物为刍狗
圣人不仁 以百姓为刍狗
天地之间 其犹橐龠乎 虚而不屈 动而愈出 多闻数穷 不如守于中

谷神不死 是谓玄牝
玄牝之门 是谓天地之根 绵绵呵 其若存 用之不堇

天长 地久
天地之所以能长且久者 以其不自生也 故能长生
是以圣人后其身而身先 外其身而身存 不以其无私邪 故能成其私

上善 若水
水善 利万物而有静 居众人之所恶 故几于道矣
居善地 心善渊 予善天 言善信 正善治 事善能 动善时 夫唯不争 故无尤

持而盈之 不如其已 揣而锐之 不可长葆也 金玉盈室 莫之能守也 富贵而骄 自遗咎也 功遂身退 天之道也

戴营魄抱一 能毋离乎
槫气致柔 能婴儿乎
修除玄监 能无疵乎
爱民活国 能毋以知乎
天门启阖 能为雌乎
明白四达 能毋以知乎
生之 畜之 生而弗有 长而弗宰 是谓玄德

卅辐同一毂 当其无 有车之用也
埏埴而为器 当其无 埴器之用也
凿户牖 当其无 有室之用也
故 有之以为利 无之以为用

五色使人之目盲 五音使人之耳聋 五味使人之口爽 驰骋畋猎使人心发狂 难得之货使人之行方
是以圣人之治也 为腹而不为目 故去彼而取此

宠辱若惊 贵大患若身
何谓宠辱若惊 宠之为下也 得之若惊 失之若惊 是谓宠辱若惊
何谓贵大患若身 吾所以有大患者 为吾有身 及吾无身 有何患
故贵为身以为天下 若可托天下 爱己身以为天下 女何以寄天下

视之而弗见 名之曰微 听之而弗闻 名之曰希 捪之而弗得 名之曰夷 三者不可致诘 故混而为一
一者 其上不谬 其下不惚 寻寻呵 不可名也 复归于无物 是谓无状之状 无物之象 是谓沕望 随而不见其后 迎而不见其首 执今之道 以御今之有 以知古始 是谓道纪

古之善为道者 微眇玄达 深不可志
夫唯不可志 故强为之容 曰 与呵 其若冬涉水 犹呵 其若畏四邻 俨呵 其若客 涣呵 其若冰泽 沌呵 其若朴 湷呵 其若浊 旷呵 其若谷
浊而静之徐清 安以动之 徐生 保此道者不欲盈 夫唯不欲盈 故能蔽而不成

致虚 极也 守静 督也 万物旁作 吾以观其复也
天物芸芸 各复归于其根 曰静 静 是谓复命
复命 常也 知常 明也 不知常 妄 妄作 凶
知常 容 容乃公 公乃王 王乃天 天乃道 道乃久 殁身不殆

太上 下知有之 其次 亲誉之 其次 畏之 其下 侮之
信不足 案有不信 猷呵 其贵言也 功成事遂 而百姓皆谓我自然

故大道废 案有仁义 知慧出 案有大伪 六亲不和 案有孝慈 邦家昏乱 案有贞臣

绝圣弃知 民利百倍 绝仁弃义 民复孝慈 绝巧弃利 盗贼无有
此三言也 以为文未足 故令之有所属 见素抱朴 少思寡欲 绝学无忧

唯与诃 其相去几何 美与恶 其相去何若 人之所畏 亦不可以不畏人
望呵 其未央才 众人熙熙 若享于太牢 而春登台 我泊焉未佻 若婴儿之未咳
累呵 如无所归 众人皆有余 我独遗 我愚人之心也 惷惷呵 鬻人察察 我独闵闵呵 忽呵 其若海 望呵 其若无所止 众人皆有以 我独顽以鄙 吾欲独异于人 而贵食母

孔德之容 唯道是从
道之物 唯望唯惚 惚呵 望呵 中有象呵 望呵 惚呵 中有物呵 幽呵 冥呵 中有请呵
其请甚真 其中有信 自今及古 其名不去 以顺众父 吾何以知众父之然 以此

炊者不立 自视者不章 自见者不明 自伐者无功 自矜者不长 其在道也 曰 余食赘行 物或恶之 故有欲者弗居

曲则全 枉则直 洼则盈 敝则新 少则得 多则惑
是以圣人执一以为天下式 不自视故章 不自现故明 不自伐故有功 弗矜故能长 夫唯不争 故莫能与之争 古之所谓曲则全者 几语才 诚全归之

希言自然 飘风不冬朝 暴雨不终日 孰为此 天地而弗能久 而况于人乎
故从事于道者同于道 德者同于德 失者同于失
同于德者 道亦德之 同于失者 道亦失之

有物混成 先天地生 萧呵 寥呵 独立而不改 可以为天地母 吾未知其名 字之曰道 强为之名曰大
大曰逝 逝曰远 远曰反
道大 天大 地大 王亦大
国中有四大 而王居其一焉
人法地 地法天 天法道 道法自然

重为轻根 静为躁君 是以君子终日行不离其辎重 唯有环官 燕处则昭若 若何万乘之主而以身轻天下 轻则失本 躁则失君

善行者无辙迹 善言者无瑕谪 善数者不以筹策 善闭者无关楗而不可启也 善结者无绳约而不可解也 是以圣人恒善救人 而无弃人 物无弃财 是谓袭明
故 善人 善人之师 不善人 善人之资也
不贵其师 不爱其资 虽知乎大迷 是谓眇要

知其雄 守其雌 为天下溪
为天下溪 恒德不离 恒德不离 复归于婴儿
知其荣 守其辱 为天下谷
为天下谷 恒德乃足 恒德乃足 复归于朴
知其白 守其黑 为天下式
为天下式 恒德不忒 恒德不忒 复归于无极
朴散则为器 圣人用之则为官长 夫大制无割

将欲取天下而为之 吾见其弗得已
夫天下 神器也 非可为者也
为者败之 执者失之
物或行或随 或嘘或吹 或强或羸 或陪或隳 是以圣人去甚 去太 去奢

以道佐人主 不以兵强于天下 其事好还
师之所居 楚棘生之 善者果而已矣 不以取强焉
果而勿娇 果而勿矜 果而勿伐 果而不得已 居是 谓果而不强
物壮则老 谓之不道 不道蚤已

夫兵者 不祥之器也 物或恶之 故有欲者弗居
君子居则贵左 用兵则贵右 故兵者 非君子之器也
兵者 不祥之器也 不得已而用之
铦袭为上 勿美也 若美之 是乐杀人也
夫乐杀人 不可以得志于天下矣 是以吉事上左 丧事上右 是以偏将军居左 上将军居右 言以丧礼居之也 杀人众 以悲哀泣之 战胜 以丧礼处之

道恒无名 朴虽小 而天下弗敢臣 侯王若能守之 万物将自宾 天地相合 以俞甘露 民莫之令 而自均焉
始制有名 名亦既有 夫亦将知止 知止所以不殆
俾道之在天下也 猷小谷之于江海也

知人者 知也 自知者 明也 胜人者 有力也 自胜者 强也 知足者 富也 强行者 有志也 不失其所者 久也 死而不忘者 寿也

道泛兮 其可左右也 成功遂事而弗名有也
万物归焉而弗为主 则恒无欲也 可名于小
万物归焉而弗为主 可名于大
是以圣人之能成大也 以其不为大也 故能成大

执大象 天下往 往而不害 安平泰 乐与饵 过格止 故道之出言 曰 淡呵 其无味也 视之 不足见也 听之 不足闻也 用之 不可既也

将欲拾之 必古张之 将欲弱之 必古强之 将欲去之 必古兴之 将欲夺之 必古与之 是谓微明
柔弱胜刚强 鱼不脱于渊 邦利器不可以示人

道恒无名 侯王若能守之 万物将自化
化而欲作 吾将阗之以无名之朴 夫将不欲 不欲以静 天地将自正";
    }
}
